app/controllers/posts_controller.rb

SELECT * FROM `posts`
---
  def index
    if params[:keyword]
      @posts = Posts.search(params[:keyword])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
---
  def show
    @posts = Posts.find(params[:id])

INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2010-01-16 00:03:34', 'test', 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.', '2010-01-16 00:03:34')
---
  def create
    @posts = Posts.new(params[:posts])
    if @posts.save